Revit 2027 API
ParameterTypeId.RebarShapeImage Property
 "Shape Image"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeImage { get; }
Public Shared ReadOnly Property RebarShapeImage As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeImage {
	ForgeTypeId^ get ();
}
static member RebarShapeImage : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace